ErichStyger/MetaClockClock/Firmware/tinyK22_Master_vs_code/sdk/devices/MK22F51212/drivers/fsl_dspi.c
    /* The transfer is complete. */
    handle->txData                    = NULL;
    handle->rxData                    = NULL;
    handle->remainingReceiveByteCount = 0;
    handle->remainingSendByteCount    = 0;

    status_t status;
    if (handle->state == (uint8_t)kDSPI_Error)
    {
        status = kStatus_DSPI_Error;
    }
    else
    {
        status = kStatus_Success;
    }

    handle->state = (uint8_t)kDSPI_Idle;

    if (NULL != handle->callback)
    {
        handle->callback(base, handle, status, handle->userData);
    }
}
#endif

#if !(defined(FSL_FEATURE_DSPI_HAS_NO_SLAVE_SUPPORT) && FSL_FEATURE_DSPI_HAS_NO_SLAVE_SUPPORT)
/*!
 * brief DSPI slave aborts a transfer using an interrupt.
 *
 * This function aborts a transfer using an interrupt.
 *
 * param base DSPI peripheral base address.
 * param handle Pointer to the dspi_slave_handle_t structure which stores the transfer state.
 */
void DSPI_SlaveTransferAbort(SPI_Type *base, dspi_slave_handle_t *handle)
{
    assert(NULL != handle);

    DSPI_StopTransfer(base);

    /* Disable interrupt requests */
    DSPI_DisableInterrupts(
        base, (
#if !(defined(FSL_FEATURE_FLEXCAN_HAS_NO_RSER_TFUF_SUPPORT) && FSL_FEATURE_FLEXCAN_HAS_NO_RSER_TFUF_SUPPORT)
        (uint32_t)kDSPI_TxFifoUnderflowInterruptEnable |
#endif
        (uint32_t)kDSPI_TxFifoFillRequestInterruptEnable |
               (uint32_t)kDSPI_RxFifoOverflowInterruptEnable | (uint32_t)kDSPI_RxFifoDrainRequestInterruptEnable));

    handle->state                     = (uint8_t)kDSPI_Idle;
    handle->remainingSendByteCount    = 0;
    handle->remainingReceiveByteCount = 0;
}
#endif

#if !(defined(FSL_FEATURE_DSPI_HAS_NO_SLAVE_SUPPORT) && FSL_FEATURE_DSPI_HAS_NO_SLAVE_SUPPORT)
/*!
 * brief DSPI Master IRQ handler function.
 *
 * This function processes the DSPI transmit and receive IRQ.
 *
 * param base DSPI peripheral base address.
 * param handle Pointer to the dspi_slave_handle_t structure which stores the transfer state.
 */
void DSPI_SlaveTransferHandleIRQ(SPI_Type *base, dspi_slave_handle_t *handle)
{
    assert(NULL != handle);

    uint8_t dummyPattern = DSPI_GetDummyDataInstance(base);
    uint32_t dataReceived;
    uint32_t dataSend                     = 0;
    uint32_t tmpRemainingReceiveByteCount = 0;

    /* Because SPI protocol is synchronous, the number of bytes that that slave received from the
     * master is the actual number of bytes that the slave transmitted to the master. So we only
     * monitor the received dataSize to know when the transfer is complete.
     */
    if (handle->remainingReceiveByteCount > 0U)
    {
        while ((uint32_t)kDSPI_RxFifoDrainRequestFlag ==
               (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_RxFifoDrainRequestFlag))
        {
            /* Have received data in the buffer. */
            dataReceived = base->POPR;
            /*Clear the rx fifo drain request, needed for non-DMA applications as this flag
             * will remain set even if the rx fifo is empty. By manually clearing this flag, it
             * either remain clear if no more data is in the fifo, or it will set if there is
             * more data in the fifo.
             */
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_RxFifoDrainRequestFlag);

            /* If bits/frame is one byte */
            if (handle->bitsPerFrame <= 8U)
            {
                if (NULL != handle->rxData)
                {
                    /* Receive buffer is not null, store data into it */
                    *handle->rxData = (uint8_t)dataReceived;
                    ++handle->rxData;
                }
                /* Descrease remaining receive byte count */
                --handle->remainingReceiveByteCount;

                if (handle->remainingSendByteCount > 0U)
                {
                    if (NULL != handle->txData)
                    {
                        dataSend = *handle->txData;
                        ++handle->txData;
                    }
                    else
                    {
                        dataSend = dummyPattern;
                    }

                    --handle->remainingSendByteCount;
                    /* Write the data to the DSPI data register */
                    base->PUSHR_SLAVE = dataSend;
                }
            }
            else /* If bits/frame is 2 bytes */
            {
                /* With multibytes frame receiving, we only receive till the received dataSize
                 * matches user request. Other bytes will be ignored.
                 */
                if (NULL != handle->rxData)
                {
                    /* Receive buffer is not null, store first byte into it */
                    *handle->rxData = (uint8_t)dataReceived;
                    ++handle->rxData;

                    if (handle->remainingReceiveByteCount == 1U)
                    {
                        /* Decrease remaining receive byte count */
                        --handle->remainingReceiveByteCount;
                    }
                    else
                    {
                        /* Receive buffer is not null, store second byte into it */
                        *handle->rxData = (uint8_t)(dataReceived >> 8U);
                        ++handle->rxData;
                        handle->remainingReceiveByteCount -= 2U;
                    }
                }
                /* If no handle->rxData*/
                else
                {
                    if (handle->remainingReceiveByteCount == 1U)
                    {
                        /* Decrease remaining receive byte count */
                        --handle->remainingReceiveByteCount;
                    }
                    else
                    {
                        handle->remainingReceiveByteCount -= 2U;
                    }
                }

                if (handle->remainingSendByteCount > 0U)
                {
                    if (NULL != handle->txData)
                    {
                        dataSend = *handle->txData;
                        ++handle->txData;

                        if (handle->remainingSendByteCount == 1U)
                        {
                            --handle->remainingSendByteCount;
                            dataSend |= (uint16_t)((uint16_t)(dummyPattern) << 8U);
                        }
                        else
                        {
                            dataSend |= (uint32_t)(*handle->txData) << 8U;
                            ++handle->txData;
                            handle->remainingSendByteCount -= 2U;
                        }
                    }
                    /* If no handle->txData*/
                    else
                    {
                        if (handle->remainingSendByteCount == 1U)
                        {
                            --handle->remainingSendByteCount;
                        }
                        else
                        {
                            handle->remainingSendByteCount -= 2U;
                        }
                        dataSend = ((uint32_t)(dummyPattern) << 8U) | dummyPattern;
                    }
                    /* Write the data to the DSPI data register */
                    base->PUSHR_SLAVE = dataSend;
                }
            }
            /* Try to clear TFFF by writing a one to it; it will not clear if TX FIFO not full */
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoFillRequestFlag);

            if (handle->remainingReceiveByteCount == 0U)
            {
                break;
            }
        }
    }
    /* Check if remaining receive byte count matches user request */
    tmpRemainingReceiveByteCount = handle->remainingReceiveByteCount;
    if ((handle->state == (uint8_t)(kDSPI_Error)) || (tmpRemainingReceiveByteCount == 0U))
    {
        /* Other cases, stop the transfer. */
        DSPI_SlaveTransferComplete(base, handle);
        return;
    }

#if !(defined(FSL_FEATURE_DSPI_HAS_NO_SR_TFUF_SUPPORT) && FSL_FEATURE_DSPI_HAS_NO_SR_TFUF_SUPPORT)
    /* Catch tx fifo underflow conditions, service only if tx under flow interrupt enabled */
    if (0U != (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_TxFifoUnderflowFlag))
    {
        if (0U != (base->RSER & SPI_RSER_TFUF_RE_MASK))
        {
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_TxFifoUnderflowFlag);
            /* Change state to error and clear flag */
            if (NULL != handle->txData)
            {
                handle->state = (uint8_t)kDSPI_Error;
            }
            handle->errorCount++;
        }
    }
#endif

    /* Catch rx fifo overflow conditions, service only if rx over flow interrupt enabled */
    if (0U != (DSPI_GetStatusFlags(base) & (uint32_t)kDSPI_RxFifoOverflowFlag))
    {
        if (0U != (base->RSER & SPI_RSER_RFOF_RE_MASK))
        {
            DSPI_ClearStatusFlags(base, (uint32_t)kDSPI_RxFifoOverflowFlag);
            /* Change state to error and clear flag */
            if (NULL != handle->txData)
            {
                handle->state = (uint8_t)kDSPI_Error;
            }
            handle->errorCount++;
        }
    }
}
#endif

